{
  "description": "Grim dark battle descriptions and combat messages",
        "attack_messages": {
            "pistol": "You fire your pistol!",
            "ghost_gun": "You fire your ghost gun!",
            "ar15": "You fire your AR-15!",
            "exploding_bullets": "You fire an exploding bullet! 💥 BOOM!",
            "grenade": "You throw a grenade!",
            "missile_launcher": "You fire a missile!",
            "barbed_wire_bat": "You swing your barbed wire bat!",
            "knife": "You stab with your knife!"
        },
        "player_attack_descriptions": {
            "pistol": [
                "You squeeze off a precise shot from your pistol, the barrel flashing as the bullet screams toward your target!",
                "Your pistol bucks in your hand as you fire, sending a slug hurtling through the air with deadly intent!",
                "You line up the sights and pull the trigger, your pistol roaring as it launches death toward your enemy!",
                "With practiced precision, you fire your pistol, the shot echoing like thunder in the confined space!",
                "Your finger tightens on the trigger, unleashing a devastating round that finds its mark unerringly!"
            ],
            "ghost_gun": [
                "Your ghost gun whispers death in silence, the untraceable shot eliminating your target with surgical precision!",
                "The ghost gun does its deadly work, firing a shot that leaves no evidence but a corpse cooling on the ground!",
                "You employ the untraceable firearm, its muffled report barely audible as it extinguishes another life!",
                "The ghost gun lives up to its name, firing a shot that disappears like smoke, leaving only death behind!",
                "Your untraceable weapon speaks volumes in silence, the shot finding its target with lethal accuracy!"
            ],
            "ar15": [
                "You unleash a burst from your AR-15, the rifle chattering like an angry mechanical demon!",
                "The AR-15 roars in your hands, spitting a stream of lead that tears through your enemies!",
                "You squeeze the trigger and your AR-15 responds with fury, unleashing a hailstorm of bullets!",
                "Your assault rifle bucks against your shoulder as it unleashes controlled devastation on your foes!",
                "The AR-15 sings its song of destruction, each burst finding targets with mechanical precision!"
            ],
            "exploding_bullets": [
                "You fire an exploding bullet that detonates on impact, shredding flesh and bone in a horrific explosion!",
                "The exploding round screams toward your target and erupts in a devastating blast of shrapnel and fire!",
                "Your special ammunition detonates with terrifying force, turning your enemy into a cloud of blood and gore!",
                "The exploding bullet finds its mark and unleashes hell, the detonation ripping through everything in its path!",
                "You watch as your explosive projectile impacts and erupts, painting the surroundings in crimson destruction!"
            ],
            "grenade": [
                "You hurl a grenade that bounces toward your enemies, the fuse hissing as it counts down to oblivion!",
                "The grenade leaves your hand in a perfect arc, exploding in a shower of deadly shrapnel moments later!",
                "You cook off a grenade and throw it, the explosion ripping through your enemies like divine judgment!",
                "Your grenade finds its target and detonates with earth-shaking force, scattering foes like broken dolls!",
                "The grenade explodes in a cataclysm of fire and metal, leaving nothing but silence and death in its wake!"
            ],
            "missile_launcher": [
                "You fire the missile launcher, the rocket screaming toward your target like the wrath of an angry god!",
                "The missile streaks from the launcher, its contrail marking a path of inevitable destruction!",
                "You unleash hell with the missile launcher, the projectile reducing everything in its path to rubble!",
                "The rocket-propelled death leaves your launcher, homing in on your enemies with mechanical precision!",
                "Your missile finds its mark and detonates in a massive explosion that shakes the very foundations!"
            ],
            "barbed_wire_bat": [
                "You swing your barbed wire bat with savage force, the cruel spikes tearing through flesh and bone!",
                "The barbed wire-wrapped bat connects with devastating impact, ripping and tearing everything it touches!",
                "You bring the brutal weapon down in a crushing arc, the barbed wire leaving trails of blood and agony!",
                "Your spiked bat finds its target, the barbs digging deep and tearing flesh in a symphony of pain!",
                "The barbed wire bat swings in a deadly arc, connecting with bone-crunching force and horrific tearing!"
            ],
            "knife": [
                "You lunge forward with your knife, the blade flashing as it seeks out vital arteries and organs!",
                "Your knife strikes with surgical precision, slipping between ribs to find the enemy's beating heart!",
                "You drive the blade home with lethal force, twisting and tearing through flesh and muscle!",
                "The knife finds its mark in a spray of crimson, your strike both swift and merciless!",
                "You stab with calculated brutality, the blade drinking deep of your enemy's lifeblood!"
            ]
        },
        "enemy_attack_descriptions": {
            "police_pistol": [
                "A police officer fires their service pistol, the shot narrowly missing your vital organs!",
                "The cop squeezes off a round that grazes your shoulder, leaving a burning trail of pain!",
                "Police gunfire echoes as a bullet finds your leg, the impact sending shockwaves through your body!",
                "An officer's pistol shot catches you in the side, the bullet burning a path through your flesh!",
                "The police officer fires with trained precision, their bullet finding a home in your torso!"
            ],
            "gang_pistol": [
                "A gang member fires wildly, their pistol shots spraying the area with hot lead!",
                "The gangster's pistol bucks as they fire, bullets whizzing past your head dangerously close!",
                "Gang gunfire erupts as a pistol shot catches you in the arm, the impact spinning you around!",
                "A rival thug unloads their pistol, one shot finding its mark in your chest with burning force!",
                "The gang member's pistol shot tears through your defenses, leaving you gasping in pain!"
            ],
            "squidie_pistol": [
                "A Squidie fires their customized pistol, the shot enhanced with their signature brutality!",
                "The Squidie gangster's pistol shot burns a path across your body, their aim unnaturally accurate!",
                "Squidie gunfire echoes as their bullet finds your flesh, the wound burning with unnatural heat!",
                "A Squidie thug's pistol shot catches you off guard, the impact sending waves of agony through you!",
                "The Squidie's enhanced pistol fires with deadly precision, their bullet ripping through your defenses!"
            ],
            "police_bat": [
                "A police officer swings their nightstick with brutal force, the impact cracking against your skull!",
                "The cop's baton connects with crushing force, stars exploding in your vision from the blow!",
                "Police brutality rains down as the officer's nightstick finds your ribs with bone-crunching impact!",
                "An officer's baton swing catches you across the back, the pain exploding through your body!",
                "The police officer's nightstick descends like judgment, connecting with devastating force!"
            ],
            "gang_bat": [
                "A gang member swings their improvised weapon, the crude bat connecting with savage force!",
                "The gangster's bat finds your shoulder, the impact sending shockwaves of pain through your body!",
                "Gang brutality erupts as a bat swing catches you in the gut, driving the air from your lungs!",
                "A rival thug's bat connects with your leg, the blow nearly taking you off your feet!",
                "The gang member's improvised weapon finds its mark, the impact leaving you reeling in pain!"
            ],
            "squidie_tentacle": [
                "A Squidie's tentacle whips out with inhuman speed, the slimy appendage lashing across your face!",
                "The Squidie abomination strikes with its tentacle, the blow leaving a burning trail on your skin!",
                "Squidie tentacles lash out like whips, one finding your chest with crushing, burning force!",
                "A Squidie's unnatural limb connects with devastating impact, the touch burning like acid!",
                "The Squidie monster's tentacle strikes with otherworldly strength, leaving you gasping in agony!"
            ],
            "knife_attack": [
                "An enemy knife flashes toward you, the blade seeking out your most vulnerable areas!",
                "A blade-wielding attacker lunges, their knife finding a home in your defenses!",
                "The knife strikes with deadly precision, slipping past your guard to draw blood!",
                "An enemy's blade connects with burning sharpness, the wound deep and immediately painful!",
                "The knife-wielding foe strikes true, their blade opening a line of fire across your body!"
            ]
        },
        "exploding_damage_messages": {
            "police": "💥 The exploding bullet detonates on impact, shredding the police officer's body in a horrific explosion of blood and bone fragments!",
            "gang": "💥 The exploding bullet erupts inside the gang member's chest, blasting apart their ribcage in a shower of gore and splintered bone!",
            "squidie": "💥 The exploding bullet detonates within the Squidie monstrosity, their foul flesh exploding outward in a putrid spray of ichor and viscera!",
            "generic": "💥 The exploding bullet detonates with devastating force, tearing through flesh and bone in a catastrophic explosion of tissue and blood!"
        },
  "gang_attack_messages": {
    "pistol": "Your gang member unleashes a hail of lead, each bullet finding its mark in the enemy's decaying flesh!",
    "ar15": "Your gang member sprays death with ruthless efficiency, their AR-15 singing a dirge for the fallen!",
    "barbed_wire_bat": "Your gang member smashes bone and sinew with their barbed weapon, painting the ground in crimson!",
    "knife": "Your gang member strikes with lethal precision, their blade drinking deep of enemy lifeblood!"
  },
  "damage_messages": {
    "enemy_damage": "The enemy strikes back with savage fury, their attacks leaving bloody furrows in your flesh!",
    "vest_absorbs": "Your vest catches the brunt of the assault, sparing you from the worst of the carnage!",
    "vest_breaks": "Your vest shatters under the relentless assault, leaving you exposed to the enemy's merciless wrath!"
  },
  "kill_messages": {
    "police_singular": "💀 You extinguish the life of a corrupt enforcer, their badge stained with the blood of the innocent!",
    "police_plural": "💀 You slaughter {count} police dogs, their uniforms soaked in the blood of those they preyed upon!",
    "gang_singular": "💀 You eradicate a rival predator from the streets, their corpse a warning to others in the shadows!",
    "gang_plural": "💀 You butcher {count} rival gang scum, their bodies littering the ground like the refuse they are!",
    "squidie_singular": "💀 You slay a Squidie abomination, their foul blood pooling in the gutters where it belongs!",
    "squidie_plural": "💀 You massacre {count} Squidie monstrosities, their vile empire crumbling with each corpse!",
    "generic_singular": "💀 You end the miserable existence of another wretched soul, their life extinguished in the darkness!",
    "generic_plural": "💀 You annihilate {count} enemy wretches, their broken forms testament to your merciless dominance!",
    "police_individual": "💀 You swing your barbed wire bat with savage force, the cruel spikes tearing through flesh and bone in a symphony of agony! A police officer falls, their life extinguished!",
    "gang_individual": "💀 You swing your barbed wire bat with savage force, the cruel spikes tearing through flesh and bone in a symphony of agony! A gang member crumples to the ground, defeated!",
    "squidie_individual": "💀 You swing your barbed wire bat with savage force, the cruel spikes tearing through flesh and bone in a symphony of agony! A Squidie monstrosity falls, their foul blood pooling!",
    "generic_individual": "💀 You swing your barbed wire bat with savage force, the cruel spikes tearing through flesh and bone in a symphony of agony! An enemy falls, their life extinguished!"
  },
  "victory_messages": {
    "complete_victory": "VICTORY! You have annihilated every last one of these pathetic wretches, their blood staining the ground!",
    "partial_victory": "VICTORY! You slaughtered {killed} and drove the survivors into the shadows, broken and fleeing!",
    "recruitment": "One of the defeated wretches begs for mercy and joins your ranks, their loyalty forged in terror and blood!",
    "npc_defeated": "You vanquish {npc_name}, their body crumpling to the ground in a lifeless heap, looted for $100 of meager possessions!",
    "detailed_stats": "VICTORY! Combat Statistics - Killed: {killed}, Recruited: {recruited}, Escaped: {escaped}",
    "police_victory": "VICTORY! You eliminated {killed} corrupt police officers, {recruited} joined your gang in fear, {escaped} escaped!",
    "gang_victory": "VICTORY! You crushed {killed} rival gang members, {recruited} defeated enemies switched sides, {escaped} escaped!",
    "squidie_victory": "VICTORY! You slaughtered {killed} Squidie monstrosities, {recruited} joined your gang, {escaped} escaped! Their foul empire weakens!"
  },
  "defeat_messages": {
    "standard": "DEFEAT! The enemy overwhelms you with brutal force, leaving you broken and bleeding on the cold ground!",
    "final_death": "FINAL DEATH! Your last life is extinguished in a torrent of agony, your body joining the countless others in eternal darkness!",
    "damage_taken": "You suffer {damage} grievous wounds, your flesh torn and blood flowing freely!"
  },
  "flee_messages": {
    "success": "You flee into the shadows like a hunted animal, heart pounding with the terror of the pursuit!",
    "failure": "Your desperate flight fails, and the enemy descends upon you with renewed savagery, tearing into your flesh!"
  },
  "combat_status": {
    "start_combat": "COMBAT BEGINS! The air thickens with the stench of fear and blood as battle erupts!",
    "enemy_counterattack": "The enemy retaliates with savage ferocity, their weapons seeking your vital organs!",
    "defend_action": "You crouch in desperate defense, weathering the storm of blows that rains down upon you!",
    "change_weapon": "You hesitate, your mind racing through the arsenal of death at your disposal!",
    "use_drug_crack": "You consume crack with desperate hunger, your body surging with unholy power but taking damage from the foul substance!",
    "use_drug_percs": "You swallow painkillers, dulling the agony and healing {healed} wounds through chemical oblivion!",
    "drug_generic": "You ingest {drug_name}, feeling its dark influence course through your veins!"
  },
  "squidie_specific": {
    "gang_loss": "The Squidies' foul empire suffers a grievous wound, losing {count} of their monstrous brethren to your righteous fury!"
  }
}
