{
  "description": "Grim dark battle descriptions and combat messages",
  "ghost_gun_explosion_descriptions": [
    "CATASTROPHIC FAILURE! Your ghost gun explodes in a shower of molten metal and burning propellant! The blast chars your face and hands with sizzling burns, sending jagged shards tearing through your flesh!",
    "OH GOD! The ghost gun backfires with terrifying force, the weapon shattering into red-hot fragments that embed themselves deep in your arm! Blood and burning oil spray across your chest!",
    "FIRE IN THE HOLE! Your ghost gun's chamber ruptures in an explosion! Your hand is reduced to a bloody pulp, fingers blown off as the weapon disintegrates in your grip!",
    "MERCIFUL MOTHER OF GOD! The ghost gun detonates, sending molten steel into your face! Your cheek is ripped clean off, exposing raw, bleeding muscle!",
    "THE GUN JUST BLEW UP! A gout of flame erupts from the breach, engulfing your arm in burning gases! Your flesh sizzles as the weapon tears itself apart!"
  ],
  "grim_death_descriptions": [
    "A hail of bullets rips through Squad Member #{member_num}, their body jerking violently as blood sprays across the ground!",
    "Your loyal Lieutenant #{member_num} screams as gunfire shreds their chest, collapsing in a pool of their own viscera!",
    "Gang Member #{member_num} takes a fatal shot to the throat, gurgling wetly as blood pours from the wound!",
    "Enemy fire catches Soldier #{member_num} in the gut, their intestines spilling onto the street!",
    "A bullet punches through Trooper #{member_num}'s skull, brain matter splattering with a sickening crack!",
    "Loyal Squad Member #{member_num} collapses with multiple gunshot wounds, their blood pooling beneath them!",
    "Your Enforcer #{member_num} takes a final, fatal shot, their eyes glazing over as life drains away!",
    "Companion #{member_num} falls with a guttural cry, comrades forced to step over their still-twitching corpse!"
  ],
  "collateral_death_descriptions": [
    "In the chaos of battle, a stray bullet catches Squad Member #{member_num} in the temple - their skull exploding in a fountain of gore!",
    "The crossfire is merciless - Trooper #{member_num} takes shrapnel to the neck, arterial blood spraying like a macabre sprinkler!",
    "A ricochet claims Gang Member #{member_num}, their screams cut short as they claw futilely at the hole in their chest!",
    "Enforcer #{member_num} drops silently, a bullet having passed through their spine!",
    "The close-quarters combat turns deadly - Lieutenant #{member_num}'s arm is blown off at the shoulder, bleeding out in seconds!",
    "Bullets fly everywhere - Soldier #{member_num} catches one in the eye socket, their orbital cavity erupting in bloody ruin!"
  ],
  "player_attack_descriptions": {
    "pistol": [
      "You squeeze off a precise shot from your pistol, the barrel flashing as the bullet screams toward your target!",
      "Your pistol bucks as you fire, sending a slug hurtling through the air with deadly intent!",
      "You line up the sights and pull the trigger, your pistol roaring as it launches death toward your enemy!",
      "With practiced precision, you fire your pistol, the shot echoing like thunder!",
      "Your finger tightens on the trigger, unleashing a devastating round that finds its mark unerringly!"
    ],
    "ghost_gun": [
      "Your ghost gun whispers death in silence, the untraceable shot eliminating your target with surgical precision!",
      "The ghost gun does its deadly work, firing a shot that leaves no evidence but a corpse cooling on the ground!",
      "You employ the untraceable firearm, its muffled report barely audible as it extinguishes another life!"
    ],
    "ar15": [
      "You unleash a burst from your AR-15, the rifle chattering like an angry mechanical demon!",
      "The AR-15 roars in your hands, spitting a stream of lead that tears through your enemies!",
      "You squeeze the trigger and your AR-15 responds with fury, unleashing a hailstorm of bullets!",
      "Your assault rifle bucks against your shoulder as it unleashes controlled devastation on your foes!"
    ],
    "exploding_bullets": [
      "You fire an exploding bullet that detonates on impact, shredding flesh and bone in a horrific explosion!",
      "The exploding round screams toward your target and erupts in a devastating blast of shrapnel and fire!",
      "Your special ammunition detonates with terrifying force, turning your enemy into a cloud of blood and gore!"
    ],
    "hollow_point_bullets": [
      "You fire a hollow point bullet that expands on impact, creating devastating wound channels!",
      "The hollow point round mushrooms dramatically as it strikes, maximizing tissue damage and stopping power!",
      "Your specialized ammunition fragments inside the target, causing massive internal trauma and blood loss!"
    ],
    "grenade": [
      "You hurl a grenade that bounces toward your enemies, the fuse hissing as it counts down to oblivion!",
      "The grenade leaves your hand in a perfect arc, exploding in a shower of deadly shrapnel moments later!",
      "You cook off a grenade and throw it, the explosion ripping through your enemies like divine judgment!"
    ],
    "missile_launcher": [
      "You fire the missile launcher, the rocket screaming toward your target like the wrath of an angry god!",
      "The missile streaks from the launcher, its contrail marking a path of inevitable destruction!",
      "You unleash hell with the missile launcher, the projectile reducing everything in its path to rubble!"
    ],
    "barbed_wire_bat": [
      "You swing your barbed wire bat with savage force, the cruel spikes tearing through flesh and bone!",
      "The barbed wire-wrapped bat connects with devastating impact, ripping and tearing everything it touches!",
      "You bring the brutal weapon down in a crushing arc, leaving trails of blood and agony!"
    ],
    "knife": [
      "You lunge forward with your knife, the blade flashing as it seeks out vital arteries and organs!",
      "Your knife strikes with surgical precision, slipping between ribs to find the enemy's beating heart!",
      "You drive the blade home with lethal force, twisting and tearing through flesh and muscle!"
    ],
    "vampire_bat": [
      "You swing your vampire bat with savage force, the cruel spikes tearing through flesh and bone!",
      "The vampire bat connects with devastating impact, ripping and tearing everything it touches!"
    ],
    "chain_whip": [
      "You crack your chain whip with deadly precision, the links wrapping around your enemy's limbs!",
      "The chain whip catches your target, yanking them off their feet with brutal force!"
    ],
    "sword": [
      "You slash with your sword, the blade gleaming as it cuts through air and enemy alike!",
      "The sword finds its mark, steel parting flesh with ancient lethality!"
    ],
    "axe": [
      "You swing your axe with tree-felling force, the blade biting deep into enemy flesh!",
      "The axe connects with bone-crushing power, splitting armor and skull alike!"
    ],
    "golden_gun": [
      "You fire the golden gun, its gleaming barrel marking death with golden finality!",
      "The golden gun speaks once, its shot finding its mark with mythological precision!"
    ],
    "poison_blowgun": [
      "You blow a poisoned dart, its tiny form carrying death on silent wings!",
      "The poison dart finds its mark, toxins spreading through your enemy's veins!"
    ],
    "plasma_cutter": [
      "You activate the plasma cutter, its humming blade slicing through flesh like butter!",
      "The plasma blade burns through armor and bone with equal ease!"
    ]
  },
  "enemy_attack_descriptions": {
    "police_pistol": [
      "A police officer fires their service pistol, the shot narrowly missing your vital organs!",
      "The cop squeezes off a round that grazes your shoulder, leaving a burning trail of pain!",
      "Police gunfire echoes as a bullet finds your leg, the impact sending shockwaves through your body!",
      "An officer's pistol shot catches you in the side, the bullet burning a path through your flesh!"
    ],
    "gang_pistol": [
      "A gang member fires wildly, their pistol shots spraying the area with hot lead!",
      "The gangster's pistol bucks as they fire, bullets whizzing past your head dangerously close!",
      "Gang gunfire erupts as a pistol shot catches you in the arm, the impact spinning you around!"
    ],
    "squidie_pistol": [
      "A Squidie fires their customized pistol, the shot enhanced with their signature brutality!",
      "The Squidie gangster's pistol shot burns a path across your body!",
      "Squidie gunfire echoes as their bullet finds your flesh, the wound burning with unnatural heat!"
    ],
    "knife_attack": [
      "An enemy knife flashes toward you, the blade seeking out your most vulnerable areas!",
      "A blade-wielding attacker lunges, their knife finding a home in your defenses!",
      "The knife strikes with deadly precision, slipping past your guard to draw blood!"
    ],
    "junkyard_dog_pistol": [
      "Junkyard Dog lunges at you with feral intensity, sinking jagged teeth into your flesh!",
      "The Junkyard Dog charges like a rabid scavenger, claws raking through your defenses!",
      "Junkyard Dog's eyes glow with insane hunger as he leaps upon you, tearing into you with savage ferocity!"
    ],
    "police_bat": [
      "A police officer swings their nightstick with brutal force, the impact cracking against your skull!",
      "The cop's baton connects with crushing force, stars exploding in your vision!"
    ],
    "gang_bat": [
      "A gang member swings their improvised weapon, the crude bat connecting with savage force!",
      "The gangster's bat finds your shoulder, the impact sending shockwaves of pain through your body!"
    ],
    "squidie_tentacle": [
      "A Squidie's tentacle whips out with inhuman speed, the slimy appendage lashing across your face!",
      "The Squidie abomination strikes with its tentacle, the blow leaving a burning trail on your skin!"
    ]
  },
  "gang_attack_messages": {
    "pistol": "Your gang member unleashes a hail of lead, each bullet finding its mark in the enemy's decaying flesh!",
    "ar15": "Your gang member sprays death with ruthless efficiency, their AR-15 singing a dirge for the fallen!",
    "barbed_wire_bat": "Your gang member smashes bone and sinew with their barbed weapon, painting the ground in crimson!",
    "knife": "Your gang member strikes with lethal precision, their blade drinking deep of enemy lifeblood!"
  },
  "victory_messages": {
    "complete_victory": "VICTORY! You have annihilated every last one of these pathetic wretches, their blood staining the ground!",
    "partial_victory": "VICTORY! You slaughtered {killed} and drove the survivors into the shadows, broken and fleeing!",
    "police_victory": "VICTORY! You eliminated {killed} corrupt police officers, {recruited} joined your gang in fear, {escaped} escaped!",
    "gang_victory": "VICTORY! You crushed {killed} rival gang members, {recruited} defeated enemies switched sides, {escaped} escaped!",
    "squidie_victory": "VICTORY! You slaughtered {killed} Squidie monstrosities, {recruited} joined your gang, {escaped} escaped!"
  },
  "defeat_messages": {
    "standard": "DEFEAT! The enemy overwhelms you with brutal force, leaving you broken and bleeding on the cold ground!",
    "final_death": "FINAL DEATH! Your last life is extinguished in a torrent of agony, your body joining the countless others in eternal darkness!"
  },
  "flee_messages": {
    "success": "You flee into the shadows like a hunted animal, heart pounding with the terror of the pursuit!",
    "failure": "Your desperate flight fails, and the enemy descends upon you with renewed savagery, tearing into your flesh!"
  }
}
