{
  "description": "Wander events and messages for city exploration",
  "wander_messages": [
    "You stumble upon a gutted corpse in an alleyway, blood pooling around the severed limbs. You search the remains and find $500 in bloody cash!",
    "A street performer lies slaughtered on the sidewalk, throat slit ear to ear. You overhear whispers of upcoming turf wars from nearby shadows.",
    "You witness a drive-by shooting where rival gang members get their brains blown out onto the pavement, painting the walls red.",
    "You find a quiet spot littered with mangled body parts to rest, regaining health amidst the stench of death.",
    "You notice suspicious activity - a beheaded body hanging from a streetlight - but decide to keep moving before you're next.",
    "You bump into an old contact who's missing an eye and bleeding profusely, sharing gossip about the bloody underworld.",
    "You wander into a rough neighborhood where limbs are strewn across the streets and narrowly avoid getting gutted yourself.",
    "You find some discarded drugs worth $200 on the street, next to a tortured corpse with carved flesh.",
    "You help a local shopkeeper who's covered in blood from a recent massacre, getting rewarded with information about safe havens.",
    "You wander around the city, stepping over dismembered bodies without incident, the air thick with the coppery smell of blood.",
    "You see a police patrol investigating a pile of corpses and quickly hide in an alley reeking of rotting flesh.",
    "You find a hidden stash of weapons beneath a freshly killed body, blood still warm on the ground.",
    "You encounter a beggar missing limbs who tells you about secret locations while bleeding out from multiple stab wounds.",
    "You wander through a market district where bodies hang from hooks like meat, haggling for better prices amidst the gore.",
    "You stumble upon a gang recruitment drive where initiates are branded with hot irons and tortured to prove loyalty.",
    "You pass by a burned-out storefront, smoke still rising from the ashes. Recent gang violence, by the looks of it.",
    "You hear distant gunfire followed by screams. Best to steer clear of whatever's happening.",
    "A body drops from a rooftop above you, landing with a sickening thud. Someone's been busy.",
    "You find a dead courier with a package still clutched in cold fingers. Inside: $500 in unmarked bills.",
    "Two gangs are fighting over territory nearby. You watch from the shadows as bodies pile up.",
    "You stumble upon an abandoned drug lab, still humming with equipment. Someone left in a hurry.",
    "A traumatized survivor huddled in an alley begs for help. You give them $100 and move on.",
    "You find a secret meeting spot where gang leaders discuss territory lines. You listen and learn.",
    "A sniper shot rings out and a body falls from a nearby building, splattering on the pavement below.",
    "You walk through an area where the bodies have been stacked like firewood. Someone's making a statement.",
    "Molotov cocktails rain down on an enemy stronghold across the street. The fire illuminates your path.",
    "You find a wounded enemy soldier dragging themselves through the gutter. You put them out of their misery.",
    "A police raid is in progress nearby. You hear screaming and gunfire. Best to disappear.",
    "You discover a tunnel entrance hidden behind a dumpster. Could lead somewhere interesting...",
    "A gang war erupts in front of you. You duck for cover as bullets fly in all directions.",
    "You find loot dropped in the chaos of a firefight: $300 and a handful of bullets.",
    "The smell of decay is overwhelming as you pass by a mass grave site.",
    "You witness an assassination - a figure in black drops from a rooftop and vanishes into shadows.",
    "Someone offers to sell you stolen goods at a fraction of their worth. Worth considering.",
    "You find a hidden stash of medical supplies. Enough to heal your wounds completely.",
    "A firefight breaks out between rival gangs. You slip away unnoticed,捡起 $400 dropped in the chaos.",
    "You hear someone begging for mercy. By the time you arrive, it's too late.",
    "You find graffiti on the wall marking gang territory. Best to keep moving.",
    "A stray dog with torn ears guards a pile of bodies, snarling at you. You give it a wide berth.",
    "You discover a body with pockets full of drugs. You take the merchandise worth $600.",
    "The sounds of torture echo from a nearby warehouse. You hasten your pace away.",
    "You find an old soldier dying from wounds. He gives you his dog tags and his gun.",
    "A rain of bullets forces you to take cover behind a pile of corpses. Desperate times.",
    "You find a secret passage leading to underground tunnels. Many ways in, few ways out.",
    "Someone offers to pay you to deliver a message to a rival gang. The pay is $1000. Risky.",
    "You stumble upon an execution in progress. The victims see you. So do the executioners.",
    "A firefight between gang members and police blocks your path. You wait it out.",
    "You find a dead informant with notes on gang movements. This intel could be valuable."
  ]
}
