{
  "description": "Weapon-specific kill messages for grim dark combat",
  "weapons": {
    "pistol": [
      "💀 You fire your pistol with deadly precision! An enemy falls, their life is over!",
      "💀 Your pistol barks death, punching a hole through flesh and bone! An enemy crumples in a pool of their own blood!",
      "💀 The pistol's report echoes as you end another wretched existence, their corpse twitching in the gutter!"
    ],
    "ghost_gun": [
      "💀 You fire your ghost gun with deadly precision! An enemy falls, trying to cover the hole in their neck!",
      "💀 The ghost gun whispers death, leaving no trace but a corpse with a surprised expression frozen on their face!",
      "💀 Your untraceable shot finds its mark, another soul extinguished in the shadows of the city!"
    ],
    "ar15": [
      "💀 You unleash a hail of bullets from your AR-15! An enemy falls, their life has been mowed down!",
      "💀 The AR-15 roars like a mechanical beast, shredding flesh and spraying blood across the concrete!",
      "💀 Your automatic weapon sings a dirge of lead, leaving behind a mangled corpse that was once a threat!"
    ],
    "exploding_bullets": [
      "💥 BOOM! Your exploding bullet detonates in a shower of gore and shrapnel! An enemy is obliterated!",
      "💥 The bullet explodes inside their chest, painting the walls with chunks of meat and bone fragments!",
      "💥 Your explosive round turns the enemy into a crimson mist, their remains scattered like confetti from hell!"
    ],
    "grenade": [
      "💀 You throw a grenade with deadly accuracy! An enemy falls, their life is in shambles!",
      "💀 The grenade detonates in a fireball of destruction, leaving behind charred remains and the stench of burned flesh!",
      "💀 Your explosive gift claims another victim, their body torn apart by the merciless blast!"
    ],
    "missile_launcher": [
      "💀 You fire a missile with devastating force! An enemy falls, their life and body parts blown apart!",
      "💀 The missile screams through the air before exploding in a cataclysm of fire and shrapnel!",
      "💀 Your rocket-propelled death finds its target, reducing the enemy to smoking ruins on the pavement!"
    ],
    "barbed_wire_bat": [
      "💀 You swing your barbed wire bat with savage force, the cruel spikes tearing through flesh and bone in a symphony of agony! An enemy falls, their life extinguished!",
      "💀 The barbed wire bat connects with a sickening crunch, ripping flesh and exposing bone in a spray of arterial blood!",
      "💀 Your weapon of rusty terror claims another victim, their screams cut short as life drains from their mutilated form!"
    ],
    "knife": [
      "💀 You stab with your knife in a swift, deadly motion! An enemy falls, their life blood seeps onto the ground!",
      "💀 The blade slides through flesh like butter, hot blood coating your hands as another life ends!",
      "💀 Your knife finds vital organs, the enemy's eyes widening in shock as they collapse in a growing pool of crimson!"
    ],
    "default": [
      "💀 You attack with deadly force! An enemy falls, their timeline ends here!",
      "💀 Your assault proves fatal, another corpse added to the city's grim tally!",
      "💀 Death comes swiftly, the enemy's body slumping lifeless to the ground!"
    ]
  }
}
